## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/64340904/runs/6856394a-4514-492e-b30f-f413a50dc310).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>


## Dir: . | Success :thumbsup:
**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

**Step**: plan
**Success**: :thumbsup:
**Command**: `terraform plan -detailed-exitcode -out /tmp/tmpswphn9dw/plan`
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_api_key.mock_api_key will be created
+   resource "aws_api_gateway_api_key" "mock_api_key" {
+       arn               = (known after apply)
+       created_date      = (known after apply)
+       description       = "Managed by Terraform"
+       enabled           = true
+       id                = (known after apply)
+       last_updated_date = (known after apply)
+       name              = "mock-api-key"
+       tags_all          = (known after apply)
+       value             = (sensitive value)
    }

  # aws_api_gateway_deployment.mock_api must be replaced
+/- resource "aws_api_gateway_deployment" "mock_api" {
!       created_date  = "2025-04-12T06:57:05Z" -> (known after apply)
!       execution_arn = "arn:aws:execute-api:eu-west-1:***:5fa7xm30gb/test" -> (known after apply)
!       id            = "0tqdyo" -> (known after apply)
!       invoke_url    = "https://5fa7xm30gb.execute-api.eu-west-1.amazonaws.com/test" -> (known after apply)
-       stage_name    = "test" -> null # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.test_stage will be created
+   resource "aws_api_gateway_stage" "test_stage" {
+       arn           = (known after apply)
+       deployment_id = (known after apply)
+       execution_arn = (known after apply)
+       id            = (known after apply)
+       invoke_url    = (known after apply)
+       rest_api_id   = "5fa7xm30gb"
+       stage_name    = "test"
+       tags_all      = (known after apply)
+       web_acl_arn   = (known after apply)
    }

  # aws_api_gateway_usage_plan.mock_api_usage_plan will be created
+   resource "aws_api_gateway_usage_plan" "mock_api_usage_plan" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       name     = "mock-api-usage-plan"
+       tags_all = (known after apply)

+       api_stages {
+           api_id = "5fa7xm30gb"
+           stage  = "test"
        }
    }

  # aws_api_gateway_usage_plan_key.mock_api_usage_plan_key will be created
+   resource "aws_api_gateway_usage_plan_key" "mock_api_usage_plan_key" {
+       id            = (known after apply)
+       key_id        = (known after apply)
+       key_type      = "API_KEY"
+       name          = (known after apply)
+       usage_plan_id = (known after apply)
+       value         = (known after apply)
    }

  # aws_lambda_function.mock_api_lambda will be updated in-place
!   resource "aws_lambda_function" "mock_api_lambda" {
        id                             = "mock-api-test-function"
!       last_modified                  = "2025-04-12T06:57:05.943+0000" -> (known after apply)
!       source_code_hash               = "ZpV5qe+dW6ETxV/8sBIb4bcICOnahSfDYdG06nOifCw=" -> "jLSrEPvBOZCZ8oQPwZbmUeUSK3SLvozllqajRRXAJ0k="
        tags                           = {}
        # (22 unchanged attributes hidden)

!       environment {
!           variables = {
-               "MOCK_API_KEY" = (sensitive value)
-               "MOCK_API_URL" = "https://5fa7xm30gb.execute-api.eu-west-1.amazonaws.com/test/weather"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 5 to add, 1 to change, 1 to destroy.

Changes to Outputs:
!   mock_api_url        = "https://5fa7xm30gb.execute-api.eu-west-1.amazonaws.com/test/weather" -> (known after apply)

```

</details>

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
